[{"title":"Garupa-Groomix Music Radio","description":"<p>I've been trying to broadcast a YouTube live stream using ffmpeg. Now that (I think) I get the idea, I want to create some kind of 24/7 music stream.</p><p>Since I really like BanG Dream and D4DJ, I decided to use their music. But well, it's on YouTube so I don't really know what will happen in the future. I hope I don't get a strike(s) from the Japanese conglomerate entertainment company behind the two idol franchises.</p><p>For the visual, it's rather poor because I didn't bother creating something cool, yet. After all, it's a music stream, so I don't see the urgency of creating fancy visuals.</p><p>Anyway, here's the link to the YouTube stream: <a href=\"https://youtu.be/qwrSxwoxn-E\">https://youtu.be/qwrSxwoxn-E</a></p>","date":"2022-05-28T06:33:57.057+07:00","pubDate":"Sat, 28 May 2022 06:33:57 +0700","uri":"garupa-groomix-music-radio"},{"title":"Forgot to set the env variable to \"production\"","description":"<p>Sometimes I forget to set the env variable of this site and <a href=\"https://manga.lapetite.moe\">LaPetiteManga</a> to \"production\". That means the blog and doujin entries would be taken from a dummy database instead of a real one. I don't think it had impacted anyone previously, but in case you're subscribed to the RSS feed(s), you might see weird titles such as \"Peaky P-key\", \"Testing\", or other nonsense. If you did, now you know what had happened.</p><p>(No Peaky P-key doujin, it was just a random title)</p>","date":"2022-04-26T23:20:08.305+07:00","pubDate":"Tue, 26 Apr 2022 23:20:08 +0700","uri":"forgot-to-set-the-env-variable-to-production"},{"title":"I hath becometh a Yu-Gi-Zoomer: Ecclesia and other waifu","description":"<p>I'm writing this entry to test if I can put some images (no fancy layout, though). All of the previous entries are just pure text. Let's see how it goes by putting some waifu. Yu-Gi-Oh Waifu!</p><p>On late January 2022, the Japanese entertainment conglomerate and video game company Komoney released Yu-Gi-Oh! Master Duel. I had a little real-life Yu-Gi-Oh experience previously, but it all was just about playing (old and outdated) waifu decks. The habit continues to Master Duel when I discover more waifu. Here are some of my favorites so far.</p><h2>Ecclesia</h2></p><div class=\"text-center m-3\"><img src=\"https://pl.nikotile.xyz/media/79544ebe6407b643625376cda50687c7921127072fcee99c117ea96574a7cc18.png\"></p><div class=\"text-center m-3\"><img src=\"https://pl.nikotile.xyz/media/c04c1b08e6b844a4397962b1262ff97d2d8a779aaedb1687c5e40b7dcdef496c.png\"></p><p>Her name shall be mentioned on the title.</p><p>Despite being the same Ecclesia. The two cards come from different archetypes. The lore around it is so cool. They're also related to other archetypes such as Tri-Brigade, Springans, Despia, Swordsoul, and probably other archetypes I have no knowledge of. Komoney really should invest in anime or other media that explain this lore! They're keep making anime to promote the cards, and probably to younger audience.</p><h2>Sera and Rafflesia</h2></p><div class=\"text-center m-3\"><img src=\"https://pl.nikotile.xyz/media/803f8c12bde20a29e144795b5224cf8b9673c921f08e29f14be7b5acc3e45dae.png\"></p><div class=\"text-center m-3\"><img src=\"https://pl.nikotile.xyz/media/b9712fab03c66c483f46ec2ef568aa718638954fab30c924c6d32eae3e2d6a44.png\"></p><p>They're from the Traptrix archetype. I use this archetype very frequently because I like the idea of luring my enemies (or myself, actually) into cute anime girls who turn out to have very dangerous traps set.</p><h2>Verre</h2></p><div class=\"text-center m-3\"><img src=\"https://pl.nikotile.xyz/media/cb25a3fe7457fcc63cafba53c31b2a5d742f0d718ec9948aa8aa9a929fb6fccf.png\"></p><div class=\"text-center m-3\"><img src=\"https://pl.nikotile.xyz/media/b7e47d4ef56c220706c712df859912cb3bbad5a6e111f270111cee5f3d019617.png\"></p><p>The smug queen Witchcrafter Madame Verre is probably a lolibaba. The second card, Rilliona, is supposed to be her younger self. But doesn't it make it cooler?</p><h2>Teardrop</h2></p><div class=\"text-center m-3\"><img src=\"https://pl.nikotile.xyz/media/e44918686856e606def74176ef54b977093f6e876f301c384afe891d88073d67.png\"></p><p>I like her because, well, not much reasoning, it's just very cute and very anime.</p><p>Yes, that's it. That was me posting some waifu by testing my website feature as an excuse.</p>","date":"2022-04-06T20:44:53.445+07:00","pubDate":"Wed, 06 Apr 2022 20:44:53 +0700","uri":"i-hath-becometh-a-yu-gi-zoomer-ecclesia-and-other-waifu"},{"title":"wibu-rss: Generating feeds from otaku news sites","description":"<p>I've been trying to do shell scripting to create RSS feeds using parsed HTML data from three Indonesian otaku news site. I'm not sure if it's POSIX-compliant, though. In addition, I'm not a shell wizard, so I got very confused initially.</p><p>But now, it's finished! I, and you Indonesian readers/watchers, can now read Risa Media, Media Formasi, and KANAU from RSS (I don't bother linking their sites here)!</p><p>You can check my script <a href=\"https://github.com/nikotile/wibu-rss\">here</a>. Or if you just want to use the XML files directly, you can go to the newly-added <a href=\"/library\">library</a> section.</p><p></p>","date":"2022-01-15T13:45:25.713+07:00","pubDate":"Sat, 15 Jan 2022 13:45:25 +0700","uri":"wibu-rss-generating-feeds-from-otaku-news-sites"},{"title":"Notes on Early 2010s Weebs","description":"<p><i>I can't believe I call myself a weeb/wibu/otaku but rarely write about them.</i></p><p>I recently watched the Sword Art Online: Progressive movie, the one with the title <i>Hoshi Naki Yoru no Aria</i> (Aria of a Starless Night). It reminded me of 10 years ago when the Sword Art Online TV series first aired. The early 2010s was, I think, one of the pivotal moments in weeb culture because it gave born to a new generation of, well, weebs. It sounds like a generalization but if we narrow it down to only <b>Indonesian weebs</b>, I know I'm right. Let's ignore the previous generation(s) and the recently born one during the pandemic.</p><p>What I like about these early 2010s weebs is that they know how to consume otaku media freely. They know how to use some Internet to hop between fansubs. Alternatively, hey, they know how to distinguish between download buttons that will really give them subbed anime or the one that will give them ads. Older weebs may have these \"abilities\" as well, but at the time they were already adults. That's not really impressive because adults should have those as basic Internet survival abilities. However, early 2010s weebs were mainly composed of teenagers. Therefore, if one of them was a <i>chuunibyou</i>, there's a chance if the person is a <i>chuuninensei</i> in a literal sense! Isn't it cool for them to be able to consume otaku media in a rather free manner? To choose one's favorite fansub, to choose a niche community to dwell in, that's the freedom of being a weeb.</p><p>The trends have changed nowadays, not to mention with the emergence of new groups of weebs during the pandemic. Most of them are at the mercy of big streaming services, or even worse a YouTube channel. It's because, according to my observation, they're afraid to consume anime from \"third-party sites\" or they don't know how to find them.</p><p>Time indeed flies, but oh well.</p><p></p>","date":"2022-01-13T15:37:11.353+00:00","pubDate":"Thu, 13 Jan 2022 15:37:11 +0000","uri":"notes-on-early-2010s-weebs"},{"title":"Updates: Site simplification and Gemini","description":"<p>Since 2021 is ending, I want to simplify this site.</p><h2>What's changed</h2></p><p>Not much perhaps. However, I removed Bootstrap for, well, styling and client-side Luxon for timezone-agnostic blog timestamp. Yes, please mercy me, at least I now get it that I don't need such features. Additionally, if you've been here for a while, you might notice that there's no more Illya on the home page. I removed her (so sad) to save bandwidth and to make the site loads faster.</p><h2>Gemini</h2></p><p>Recently, I heard about the Gemini protocol that's deemed to be an alternative to HTTP and Gopher. I decided to try it out and eventually made a capsule (community term for 'site') there. You can visit it at <a href=\"gemini://niko.lapetite.moe\">gemini://niko.lapetite.moe</a>. My blog, and this site in general, won't be mirrored there because I think, at the end of the day, HTTP and Gemini are of different worlds. I still like HTTP because that's what everyone uses—no need to get a special browser, no weird proxy, etc. However, my Gemini capsule will still be there and I will put different \"\"\"content\"\"\" from my main blog.</p>","date":"2021-12-30T12:55:10.797+07:00","pubDate":"Thu, 30 Dec 2021 12:55:10 +0700","uri":"updates-site-simplification-and-gemini"},{"title":"A Zoomer Thought on Fiction and Reality","description":"<p><i>It's time for a zoomer rambling.</i> </p><p>There is a recent Twitturd post in which the user stated that media such as Honkai Impact and Wonder Egg Priority did a good job in representing homosexuality in their narrative. When I say \"homosexuality\", it's tied to the American-style identity politics rather than just a form of sexuality of the neurotics (you know where this is going).</p><p>However, what really happens in those two media, two pieces of fiction? Yes, it's true that there are same-sex relationships (romantic and not) in the two media. Or, for those who aren't ready to accept the previous, there are \"weirdly intimate friendships\" between the girls. Still, I don't think that the sexuality of these girls translates directly to our real-world situation about homosexual identity politics. Why is that? It's because fiction should be taken in its most literal state, that we should only take what's already on the surface: when there's no indication, leave it be.</p><h2>No Truth</h2></p><p>The Twitturd user stated most Honkai Impact players ignored the so-called subtext of the game, the \"subplots\" about relationships between girls. I think that's actually the safest way of consuming fiction, to take it literally. This doesn't mean that it's the only way of doing it. Some forms of interpretations are good ways to enjoy fiction, to indulge in its ecstasy. Considering Honkai Impact and Wonder Egg Priority as paragons of homosexuality falls under this. However, it's wrong if we assume that by doing interpretations, we can arrive at the \"truth\" about the questioned fiction. Interpretations will never provide us with \"truth\".</p><p>The only \"truth\" we can access about fiction is that there is no hidden truth. There's this illusion that we must unveil a certain mask to access some sort of raw or pure knowledge. This is, I think, a form of human's most basic instinct: to desire something unknown, to desire more and more. We're expecting some fiction to hold hidden meaning, that is our desire. The problem arises when we're presented that there's nothing behind them. We will keep denying it, keep saying that \"it is not it!\" because we don't understand what we want in the first place and yet, we want more and more. It is, then, only natural for us to hide from this shock by constructing our own \"truth\" about the questioned fiction so that we can enjoy more, free from the deadlock of nothingness. When we do this, we enter what I previously call \"interpretations\".</p><h2>Fiction and Reality</h2></p><p>Another reason for the tendency to do interpretations is also rooted in our way of thinking that fiction is just fiction, something that isn't \"real\". The case would be different if someone didn't privilege the so-called everyday reality over fiction, if one saw fiction as another \"reality\", or in other words: if one saw that reality is just another fiction. This might be hard to accept and at first, this seems like blending reality with fiction. However, I'd say that someone who dismisses fiction that easily is in fact the one who confuses reality with fiction. In contrast, someone who privileges neither is the one who could distinguish the two. How does this work? By being aware that fiction is an autonomous realm of its own, they are safe in investing their mental energy in the two (or even more) realities. For them, then, fiction isn't a direct representative of real-world situations. It's neither their desire for a certain real-world situation to happen. For them, fiction is an authentic experience. Meanwhile, someone who privileges everyday reality over fiction is often lost. They're too quick to dismiss fiction that what's inside it must translate directly to some \"real\" social conditions. That's why they proceeded to do interpretations.</p><p>Indeed, it's easy to fall into the temptation to see fiction as reflections of reality. An example is seeing the rise of mahou shoujo trope as a sign of young girl empowerment, commonly seen in the realm of feminist academia. Mahou shoujo is a strong girl, not a damsel in distress. She isn't passive and often not subjected to the common norm of what a girl should be. It's tempting to see her as a paragon of young girl empowerment here. However, if we aren't very oblivious, we can see that mahou shoujo is often highly sexualized too. Is mahou shoujo then an indicator that young girls are sexually mistreated in real-world situations? I don't think either way of seeing mahou shoujo is correct because, again, fiction doesn't directly reflect some social situations. By not privileging everyday reality over fiction, one can see mahou shoujo as an independent \"object\" in another reality.</p><h2>Abrahamic Influence</h2></p><p>Is it too farfetched to say that Abrahamic religions influenced the global community, notably the West, to privilege everyday reality over fiction and to do what I previously call interpretations? The problem isn't \"grow up and accept reality lmao\". Rather, it's related to the anxiousness of the adherents of the Abrahamic religions about God. Firstly, God is unimaginable, and secondly, creating idols is forbidden. This led them to create and enjoy something (fiction) with excessive care. I'm not really confident with this myself but that's enough of that.</p><p>Lastly, I want to go back to interpretations once again and say \"enjoy!\" because I don't think any normal human can elude the nothingness behind fiction. And to the gentlemen of the jury, let us see how much of this zoomer thought will change in the next few years.</p>","date":"2021-12-15T17:35:02.895+07:00","pubDate":"Wed, 15 Dec 2021 17:35:02 +0700","uri":"a-zoomer-thought-on-fiction-and-reality"},{"title":"Updates, Love, and Other Delusions","description":"<p>Here are several updates from me regarding this website, my YouTube channel, and a certain project.</p><h2>Website</h2></p><p>I'm updating my website soon. It's a pretty big update, I think, so that's why an announcement is necessary. Well, it will only affect you if you've previously subscribed to my RSS feed. If you aren't, then it's not that important and you can skip to the next heading.</p><p>What's being updated? The whole website! I previously used Luke Smith's <a href='https://github.com/LukeSmithxyz/lb'>lb</a> for my blog and RSS feed generation. I will switch to my own script(?). Anyway, the current URL for my RSS feed is <a href='https://nikotile.xyz/rss.xml'>nikotile.xyz/rss.xml</a> and I will change that to <a href='https://nikotile.xyz/rss'>nikotile.xyz/rss</a> soon. If for some reason you're subscribed to my RSS feed, you can prepare to change the URL. The update will be live in less than a week since this writing is posted.</p><p>With lb gone, the weird \"rolling blog\" page will be gone too! Is it sad? I don't think so, it's a weird feature after all.</p><h2>The Strange Case of YouTube</h2></p><p>I (have to) assume that some of you find me through YouTube, even if you don't speak English. Let's briefly talk about it.</p><p>It was a random impulse that led me to create a YouTube channel and post videos there back in 2018. It turned out to be fun for the first year even though I didn't get a lot of attention. I won't get into the details of this \"journey\". Still, random people would pop in the comment box, expressing their thoughts be it to just simply respond or to laugh at me. You might want to check my first video, the one about Darling in the FranXX, to get an idea of how people interact with me.</p><p>However, it's 2021 and you might've noticed that I stopped posting frequently. Yes, I'm now bored lol. I realized that I just want to talk to people about anime and media in general, not to create videos every week or so.</p><p>Gentlemen of the jury, with this I will archive a lot of my videos!</p><h2>Wibu Paradoks and Its Discontent</h2></p><p>This one is more obscure than my YouTube channel and I think only a few of you know about this.</p><p><a href='https://wibu.nikotile.xyz'>Wibu Paradoks</a> is a collaborative project focused on a literary anthology series I started back in 2018 with some of my friends. In the weeb lingo, it's a doujin circle, sort of. We wrote three amateur anthologies and had tried to sell them in a local comiket-like event. It didn't end well. Our side products like keychains and print art are more successful than the anthology, our main project.</p><p>When the pandemic hit, the project had de facto ceased to exist. The planned fourth volume of the series was never finished. Our circle members had gone their own way.</p><p>I planned to reinitiate this project, but as something different, using a different approach as well. I'm still thinking about how but I just want to say that Wibu Paradoks won't die just yet.</p>","date":"2021-11-07T18:29:51.291+07:00","pubDate":"Sun, 07 Nov 2021 18:29:51 +0700","uri":"updates-love-and-other-delusions"},{"title":"Struggle to Seize a Meaning (featuring Vtuber)","description":"<p>There is a well-known joke in the vtuber community regarding what a vtuber really is. The joke goes like this: if a vtuber stands for \"virtual YouTuber\", every YouTuber is a vtuber! How could they not be? What we see is just an aggregate of pixels, not the real person! Indeed, that is just a joke, a stupid and trivial joke even. However, it is possible for someone to take it seriously.</p><p>I'm not that much of a vtuber fan. What I know is that vtuber has been there since the ancient times of Kizuna Ai. However, the so-called \"Hololive Boom\" made vtubers more popular than ever in the West. This inspired a lot of people to start their vtubing journey. This is where, I think, some people start to take the aforementioned joke seriously: hey, look! I'm a vtuber too because I have these pixels representing the real me. This may be easily disregarded. The harder part comes when streamers or \"content creators\" use avatars during their activities instead of revealing their real faces.</p><p>Is it hard to disregard or acknowledge these online entertainers as vtubers? It can be hard sometimes. This takes us back to the nature of meaning. Well, if we take the word \"vtuber\" in a literal sense, we could say that they are indeed virtual YouTubers. But wait, are they even on YouTube? Some of these vtubers are on other platforms like Niconico, Bilibili, or even Twitch. We see the problem now: we don't take words literally.</p><p>When we use words, there is a certain psychological investment we make. It is as if we are attached to some other properties of the word instead of the word itself. We aren't at the mercy of dictionaries. Rather, we are dictated by the social condition in which we're entangled. This is why people from different communities perceive words differently from each other. This is not necessarily a denial of 'objectivity'. This is also not an attempt to tame plurality. My statement is a rather pessimistic one because the different way of perceiving words is a kind of war. Different communities struggle to seize words and weave their \"version\" of meaning into them.</p><p>The grander way of seeing this is through \"\"\"ideology\"\"\". Now, what does it mean to be an ecologist? This is <a href=\"https://www.goodreads.com/book/show/18912.The_Sublime_Object_of_Ideology\">not my idea</a> but someone can be a social ecologist, state-oriented ecologist, conservative ecologist, and many more. Those three are the same yet different. The three aren't always in harmony. They respectively believe that their version of ecologism is the real ecologism while the others are just degenerated variations. The identity of ecologism is, thus, open and only through a certain intervention it can be halted, through a 'war'. Another example is the struggle of democracy: the communists may fight for 'real democracy' to counter the exploitative 'bourgeois formal democracy', despite both being forms of democracy. There are other examples but let's get back to vtubers because I'm but a weeb.</p><p>The same applies to the word \"vtuber\": there is an ongoing war to define what it really is. Vtubers have been closely associated with the otaku culture, or you might say \"\"\"otaku\"\"\". This is why, for some weebs, random online entertainers with avatars aren't necessarily vtubers. What separates these entertainers from 'real' vtubers is the otaku-ness around its fandom, not whether they use avatars to hide their real faces or not. However, that is different for others, preferably non-weebs. For them, any online entertainer with avatars can be a vtuber. For others, only streamers (with avatars of course) can be vtubers. There may be some other ways of defining vtuber that aren't prevalent, but that is for another day.</p><p>That is what I think about vtuber and the struggle to seize its meaning.</p>","date":"2021-10-05T11:13:50.927+07:00","pubDate":"Tue, 05 Oct 2021 11:13:50 +0700","uri":"struggle-to-seize-a-meaning-featuring-vtuber"},{"title":"Mulai Menggunakan Pleroma","description":"<p><em>English TL;DR: I started a Pleroma instance.</em></p><p>Saya baru saja set-up instance Pleroma. Apa itu Pleroma? Singkatnya, itu semacam perangkat lunak blogging mikro (mirip Twitturd). Itu bukan satu situs, melainkan hanya perangkat lunak yang di pasang di suatu server, yang kemudian dapat berkomunikasi satu sama lain.</p><p>Situs seperti <a href=\\\"https://varishangout.net/\\\">Varis.Hangout</a>, <a href=\\\"https://weeaboo.space/\\\">Weebspace</a>, dan <a href=\\\"https://fedi.absturztau.be/\\\">fedi.absturztau.be</a> adalah contoh kecil dari banyak instance Pleroma di luar sana. Mereka berbeda server, namun masih dapat berkomunikasi satu sama lain.</p><p>Masih bingung? Yah, penjelasan saya payah. Terlebih lagi, Pleroma hanyalah software yang menggunakan konsep Fediverse. Ini neologisme dari 'federation' dan 'universe', yang tentunya, karena itu sebuah konsep, lebih general lagi daripada Pleroma itu sendiri. Mungkin teman-teman dapat mencari penjelasan tentang Pleroma dan Fediverse di YouTube atau di artikel random lewat mesin pencari.</p><p>Intinya, saya membuat instance Pleroma saya sendiri di <a href=\\\"https://pl.nikotile.xyz\\\">Nikoposting</a>. Saya mengajak teman-teman untuk setidaknya mencicipi Pleroma, tidak terbatas di Nikoposting tetapi di manapun itu. Siapa tahu itu akan menjadi alternatif Twitter kesayangan Anda (atau medsos pada umumnya).</p><p>Akan tetapi, kalau ada yang mau gabung Nikoposting untuk coba-coba, boleh saja. Hubungi saya lewat email, Discord, atau YouTube. Jangan lewat FB karena saya tidak akan buka</p>","date":"2021-09-14T08:12:32.275+07:00","pubDate":"Tue, 14 Sep 2021 08:12:32 +0700","uri":"mulai-menggunakan-pleroma"},{"title":"Sosmed Cringe","description":"<p>Media (jejaring?) sosial itu cringe.</p><p>Rambling ini saya tulis langsung pakai HTML (untuk website nikotile.xyz). Jika Anda baca lewat Facebook, beberapa huruf aneh akan muncul karena Anda lagi baca update otomatis RSS (Anda juga cringe, btw). Kalau baca lewat web atau malah RSS feed, chad sekali. Tapi tidak apa-apa, rambling zoomer gak jelas ini saya tulis utamanya untuk teman-teman yang (entah mengapa mau) nge-like halaman Nikotile di FB..</p><p>Poin pertama: sosmed, medsos, medSOY, jejaring sosial, apapun lah namanya, itu cringe.</p><p>Memang benar tidak semua orang seperti ini. Tetapi yang saya rasakan adalah sebagian besar pengguna Internet terlalu bergantung pada medsos. Dulu saya pikir medsos itu menyederhanakan Internet, tentunya sederhana secara positif. Kita jadi bisa konsoom hiburan kesukaan dengan lebih mudah tanpa harus bersusah payah menggunakan mesin pencari seperti Google. Tidak perlu kita menggali-gali dengan sulitnya untuk menemukan fansub baru ketika kita ingin menonton anime bajakan. Banyak fansub-fansub ini yang memiliki presensi di timeline Facebook atau grup obscure Telegram. Banyak mutual kita di Facebook atau Twitter yang tahu daftar fansub beserta link situs dan/atau Drive mereka. Lagipula, kita (atau mungkin bukan saya) bisa nonton yang legal di YouTube.</p><p>Namun sekarang saya rasa, \"kesederhanaan\" ini justru merusak Internet. Kesederhanaannya justru menjadikan aktivitas Internet kita jadi lebih kompleks. Sekarang kita memiliki tuntutan sosial untuk hadir di berbagai medsos. Setelah selesai webinar tidak jelas, kita bertukar profil Instagram dengan sesama peserta. Setelah beberapa saat berkenalan dengan teman kuliah, kita berbagi handle Twitter. Ketika melamar kerja, sebagian melebih-lebihkan deskripsi diri di LinkedIn. Sekali lagi, tentu tidak semua orang patuh pada tuntutan tak kasatmata ini dan saya menghormati mereka.</p><p>Kompleksitas tadi tidak berhenti sampai situ. Banyak orang yang menggunakan ponsel pintar. Apa yang terjadi? Mereka unduh semua aplikasi medsos itu lewat playstore. Sekarang halaman depan ponsel mereka jadi warna-warni. Mengapa tidak pakai browser saja? Yo ndak tahu, mungkin karena medsos itu \"terlalu canggih\" untuk hanya sekedar ditampilkan di browser ponsel. Atau, mungkin karena ada hasrat untuk hadir di medsos di manapun, kapanpun.</p><p>Baiklah, sampai di situ rambling tidak bijak dari seorang zoomer. Saya ingin membicarakan satu hal lain, tapi serupa. Seperti yang saya bilang tadi, tulisan ini ditujukan bagi orang yang nge-like halaman Facebook saya. Halaman itu (atau ini) dibuat di waktu yang berdekatan dengan akun Instagram nikotile.mp4 ketika saya sedang melakukan live stream di YouTube. Mengapa saya pikir itu perlu? Karena saya cringe. Karena saya pikir platform-platform ini akan mempermudah aktivitas saya sebagai Nikotile. Apakah sekarang saya tidak cringe? Saya rasa tidak seutuhnya. Saya masih seorang zoomer bodoh. Saya belum tega untuk menghapus halaman Facebook dan akun Instagram, MESKIPUN saya sudah tidak menggunakannya lagi secara langsung. Tempat utama saya sekarang adalah Twitter (ewww) melalui browser dan, mungkin, YouTube sebagai tempat buang berak (pikiran random) tentang budaya dan media seperti biasanya.</p><p>Mungkin saya akan menggunakan halaman Facebook, tapi tidak secara langsung. Ketika saya menulis sesuatu di website saya, akan ada update otomatis seperti ini. Untuk Instagram, lol no. Lain lagi, saya sudah terlanjur menyebar link halaman Facebook dan profil Instagram saya di beberapa video YouTube. Saya masih cringe dengan diri saya: saya merasa bersalah jika ada orang random yang klik link itu dan tidak menemukan apapun ketika saya menghapus Facebook dan Instagram. Maka dari itu, saya akan membiarkannya tetapi mengosongkannya. Saya akan menaruh link website saya di sana jika orang random ini tertarik untuk lurk moar.</p><p>Oh, satu lagi, saya lebih cepat merespons email dibanding DM di platform manapun. Jangan kirimi saya meme random melalui DM Instagram dan/atau Facebook karena saya baru akan baca itu enam minggu kemudian.</p>","date":"2021-09-10T07:12:32.380+07:00","pubDate":"Fri, 10 Sep 2021 07:12:32 +0700","uri":"sosmed-cringe"},{"title":"First Blog Entry","description":"p>This is my first blog entry, well 'blog'. My website used to be, for a short period, a Node.js-powered thingy. I was, and still am, learning some computer stuff and that's why I pretentiously tried to learn Node. But at the end of the day, I just want a simple website and now I'm using <a href=\"https://github.com/LukeSmithxyz/lb\">Luke Smith's lb</a>.</p><p>Pretty cool? At least I think it is. This 'blog' also has an <a href=\"/rss\">RSS feed</a>. You can subscribe to it. That's it for now!</p>","date":"2021-09-04T18:01:55.848+07:00","pubDate":"Sat, 04 Sep 2021 18:01:55 +0700","uri":"first-blog-entry"}]