[{"title":"Updates, Love, and Other Delusions","description":"<p>Here are several updates from me regarding this website, my YouTube channel, and a certain project.</p><h2>Website</h2></p><p>I'm updating my website soon. It's a pretty big update, I think, so that's why an announcement is necessary. Well, it will only affect you if you've previously subscribed to my RSS feed. If you aren't, then it's not that important and you can skip to the next heading.</p><p>What's being updated? The whole website! I previously used Luke Smith's <a href='https://github.com/LukeSmithxyz/lb'>lb</a> for my blog and RSS feed generation. I will switch to my own script(?). Anyway, the current URL for my RSS feed is <a href='https://nikotile.xyz/rss.xml'>nikotile.xyz/rss.xml</a> and I will change that to <a href='https://nikotile.xyz/rss'>nikotile.xyz/rss</a> soon. If for some reason you're subscribed to my RSS feed, you can prepare to change the URL. The update will be live in less than a week since this writing is posted.</p><p>With lb gone, the weird \"rolling blog\" page will be gone too! Is it sad? I don't think so, it's a weird feature after all.</p><h2>The Strange Case of YouTube</h2></p><p>I (have to) assume that some of you find me through YouTube, even if you don't speak English. Let's briefly talk about it.</p><p>It was a random impulse that led me to create a YouTube channel and post videos there back in 2018. It turned out to be fun for the first year even though I didn't get a lot of attention. I won't get into the details of this \"journey\". Still, random people would pop in the comment box, expressing their thoughts be it to just simply respond or to laugh at me. You might want to check my first video, the one about Darling in the FranXX, to get an idea of how people interact with me.</p><p>However, it's 2021 and you might've noticed that I stopped posting frequently. Yes, I'm now bored lol. I realized that I just want to talk to people about anime and media in general, not to create videos every week or so.</p><p>Gentlemen of the jury, with this I will archive a lot of my videos!</p><h2>Wibu Paradoks and Its Discontent</h2></p><p>This one is more obscure than my YouTube channel and I think only a few of you know about this.</p><p><a href='https://wibu.nikotile.xyz'>Wibu Paradoks</a> is a collaborative project focused on a literary anthology series I started back in 2018 with some of my friends. In the weeb lingo, it's a doujin circle, sort of. We wrote three amateur anthologies and had tried to sell them in a local comiket-like event. It didn't end well. Our side products like keychains and print art are more successful than the anthology, our main project.</p><p>When the pandemic hit, the project had de facto ceased to exist. The planned fourth volume of the series was never finished. Our circle members had gone their own way.</p><p>I planned to reinitiate this project, but as something different, using a different approach as well. I'm still thinking about how but I just want to say that Wibu Paradoks won't die just yet.</p>","date":"2021-11-07T18:29:51.291+07:00","pubDate":"Sun, 07 Nov 2021 18:29:51 +0700","guid":1636284591291},{"title":"Struggle to Seize a Meaning (featuring Vtuber)","description":"<p>There is a well-known joke in the vtuber community regarding what a vtuber really is. The joke goes like this: if a vtuber stands for \"virtual YouTuber\", every YouTuber is a vtuber! How could they not be? What we see is just an aggregate of pixels, not the real person! Indeed, that is just a joke, a stupid and trivial joke even. However, it is possible for someone to take it seriously.</p><p>I'm not that much of a vtuber fan. What I know is that vtuber has been there since the ancient times of Kizuna Ai. However, the so-called \"Hololive Boom\" made vtubers more popular than ever in the West. This inspired a lot of people to start their vtubing journey. This is where, I think, some people start to take the aforementioned joke seriously: hey, look! I'm a vtuber too because I have these pixels representing the real me. This may be easily disregarded. The harder part comes when streamers or \"content creators\" use avatars during their activities instead of revealing their real faces.</p><p>Is it hard to disregard or acknowledge these online entertainers as vtubers? It can be hard sometimes. This takes us back to the nature of meaning. Well, if we take the word \"vtuber\" in a literal sense, we could say that they are indeed virtual YouTubers. But wait, are they even on YouTube? Some of these vtubers are on other platforms like Niconico, Bilibili, or even Twitch. We see the problem now: we don't take words literally.</p><p>When we use words, there is a certain psychological investment we make. It is as if we are attached to some other properties of the word instead of the word itself. We aren't at the mercy of dictionaries. Rather, we are dictated by the social condition in which we're entangled. This is why people from different communities perceive words differently from each other. This is not necessarily a denial of 'objectivity'. This is also not an attempt to tame plurality. My statement is a rather pessimistic one because the different way of perceiving words is a kind of war. Different communities struggle to seize words and weave their \"version\" of meaning into them.</p><p>The grander way of seeing this is through \"\"\"ideology\"\"\". Now, what does it mean to be an ecologist? This is <a href=\"https://www.goodreads.com/book/show/18912.The_Sublime_Object_of_Ideology\">not my idea</a> but someone can be a social ecologist, state-oriented ecologist, conservative ecologist, and many more. Those three are the same yet different. The three aren't always in harmony. They respectively believe that their version of ecologism is the real ecologism while the others are just degenerated variations. The identity of ecologism is, thus, open and only through a certain intervention it can be halted, through a 'war'. Another example is the struggle of democracy: the communists may fight for 'real democracy' to counter the exploitative 'bourgeois formal democracy', despite both being forms of democracy. There are other examples but let's get back to vtubers because I'm but a weeb.</p><p>The same applies to the word \"vtuber\": there is an ongoing war to define what it really is. Vtubers have been closely associated with the otaku culture, or you might say \"\"\"otaku\"\"\". This is why, for some weebs, random online entertainers with avatars aren't necessarily vtubers. What separates these entertainers from 'real' vtubers is the otaku-ness around its fandom, not whether they use avatars to hide their real faces or not. However, that is different for others, preferably non-weebs. For them, any online entertainer with avatars can be a vtuber. For others, only streamers (with avatars of course) can be vtubers. There may be some other ways of defining vtuber that aren't prevalent, but that is for another day.</p><p>That is what I think about vtuber and the struggle to seize its meaning.</p>","date":"2021-10-05T11:13:50.927+07:00","pubDate":"Tue, 05 Oct 2021 11:13:50 +0700","guid":1633407230000},{"title":"Mulai Menggunakan Pleroma","description":"<p><em>English TL;DR: I started a Pleroma instance.</em></p><p>Saya baru saja set-up instance Pleroma. Apa itu Pleroma? Singkatnya, itu semacam perangkat lunak blogging mikro (mirip Twitturd). Itu bukan satu situs, melainkan hanya perangkat lunak yang di pasang di suatu server, yang kemudian dapat berkomunikasi satu sama lain.</p><p>Situs seperti <a href=\"https://varishangout.net/\">Varis.Hangout</a>, <a href=\"https://weeaboo.space/\">Weebspace</a>, dan <a href=\"https://fedi.absturztau.be/\">fedi.absturztau.be</a> adalah contoh kecil dari banyak instance Pleroma di luar sana. Mereka berbeda server, namun masih dapat berkomunikasi satu sama lain.</p><p>Masih bingung? Yah, penjelasan saya payah. Terlebih lagi, Pleroma hanyalah software yang menggunakan konsep Fediverse. Ini neologisme dari 'federation' dan 'universe', yang tentunya, karena itu sebuah konsep, lebih general lagi daripada Pleroma itu sendiri. Mungkin teman-teman dapat mencari penjelasan tentang Pleroma dan Fediverse di YouTube atau di artikel random lewat mesin pencari.</p><p>Intinya, saya membuat instance Pleroma saya sendiri di <a href=\"https://pl.nikotile.xyz\">Nikoposting</a>. Saya mengajak teman-teman untuk setidaknya mencicipi Pleroma, tidak terbatas di Nikoposting tetapi di manapun itu. Siapa tahu itu akan menjadi alternatif Twitter kesayangan Anda (atau medsos pada umumnya).</p><p>Akan tetapi, kalau ada yang mau gabung Nikoposting untuk coba-coba, boleh saja. Hubungi saya lewat email, Discord, atau YouTube. Jangan lewat FB karena saya tidak akan buka</p>","date":"2021-09-14T08:12:32.275+07:00","pubDate":"Tue, 14 Sep 2021 08:12:32 +0700","guid":1631581952000},{"title":"Sosmed Cringe","description":"<p>Media (jejaring?) sosial itu cringe.</p><p>Rambling ini saya tulis langsung pakai HTML (untuk website nikotile.xyz). Jika Anda baca lewat Facebook, beberapa huruf aneh akan muncul karena Anda lagi baca update otomatis RSS (Anda juga cringe, btw). Kalau baca lewat web atau malah RSS feed, chad sekali. Tapi tidak apa-apa, rambling zoomer gak jelas ini saya tulis utamanya untuk teman-teman yang (entah mengapa mau) nge-like halaman Nikotile di FB..</p><p>Poin pertama: sosmed, medsos, medSOY, jejaring sosial, apapun lah namanya, itu cringe.</p><p>Memang benar tidak semua orang seperti ini. Tetapi yang saya rasakan adalah sebagian besar pengguna Internet terlalu bergantung pada medsos. Dulu saya pikir medsos itu menyederhanakan Internet, tentunya sederhana secara positif. Kita jadi bisa konsoom hiburan kesukaan dengan lebih mudah tanpa harus bersusah payah menggunakan mesin pencari seperti Google. Tidak perlu kita menggali-gali dengan sulitnya untuk menemukan fansub baru ketika kita ingin menonton anime bajakan. Banyak fansub-fansub ini yang memiliki presensi di timeline Facebook atau grup obscure Telegram. Banyak mutual kita di Facebook atau Twitter yang tahu daftar fansub beserta link situs dan/atau Drive mereka. Lagipula, kita (atau mungkin bukan saya) bisa nonton yang legal di YouTube.</p><p>Namun sekarang saya rasa, \"kesederhanaan\" ini justru merusak Internet. Kesederhanaannya justru menjadikan aktivitas Internet kita jadi lebih kompleks. Sekarang kita memiliki tuntutan sosial untuk hadir di berbagai medsos. Setelah selesai webinar tidak jelas, kita bertukar profil Instagram dengan sesama peserta. Setelah beberapa saat berkenalan dengan teman kuliah, kita berbagi handle Twitter. Ketika melamar kerja, sebagian melebih-lebihkan deskripsi diri di LinkedIn. Sekali lagi, tentu tidak semua orang patuh pada tuntutan tak kasatmata ini dan saya menghormati mereka.</p><p>Kompleksitas tadi tidak berhenti sampai situ. Banyak orang yang menggunakan ponsel pintar. Apa yang terjadi? Mereka unduh semua aplikasi medsos itu lewat playstore. Sekarang halaman depan ponsel mereka jadi warna-warni. Mengapa tidak pakai browser saja? Yo ndak tahu, mungkin karena medsos itu \"terlalu canggih\" untuk hanya sekedar ditampilkan di browser ponsel. Atau, mungkin karena ada hasrat untuk hadir di medsos di manapun, kapanpun.</p><p>Baiklah, sampai di situ rambling tidak bijak dari seorang zoomer. Saya ingin membicarakan satu hal lain, tapi serupa. Seperti yang saya bilang tadi, tulisan ini ditujukan bagi orang yang nge-like halaman Facebook saya. Halaman itu (atau ini) dibuat di waktu yang berdekatan dengan akun Instagram nikotile.mp4 ketika saya sedang melakukan live stream di YouTube. Mengapa saya pikir itu perlu? Karena saya cringe. Karena saya pikir platform-platform ini akan mempermudah aktivitas saya sebagai Nikotile. Apakah sekarang saya tidak cringe? Saya rasa tidak seutuhnya. Saya masih seorang zoomer bodoh. Saya belum tega untuk menghapus halaman Facebook dan akun Instagram, MESKIPUN saya sudah tidak menggunakannya lagi secara langsung. Tempat utama saya sekarang adalah Twitter (ewww) melalui browser dan, mungkin, YouTube sebagai tempat buang berak (pikiran random) tentang budaya dan media seperti biasanya.</p><p>Mungkin saya akan menggunakan halaman Facebook, tapi tidak secara langsung. Ketika saya menulis sesuatu di website saya, akan ada update otomatis seperti ini. Untuk Instagram, lol no. Lain lagi, saya sudah terlanjur menyebar link halaman Facebook dan profil Instagram saya di beberapa video YouTube. Saya masih cringe dengan diri saya: saya merasa bersalah jika ada orang random yang klik link itu dan tidak menemukan apapun ketika saya menghapus Facebook dan Instagram. Maka dari itu, saya akan membiarkannya tetapi mengosongkannya. Saya akan menaruh link website saya di sana jika orang random ini tertarik untuk lurk moar.</p><p>Oh, satu lagi, saya lebih cepat merespons email dibanding DM di platform manapun. Jangan kirimi saya meme random melalui DM Instagram dan/atau Facebook karena saya baru akan baca itu enam minggu kemudian.</p>","date":"2021-09-10T07:12:32.380+07:00","pubDate":"Fri, 10 Sep 2021 07:12:32 +0700","guid":1631232752000},{"title":"First Blog Entry","description":"<p>This is my first blog entry, well 'blog'. My website used to be, for a short period, a Node.js-powered thingy. I was, and still am, learning some computer stuff and that's why I pretentiously tried to learn Node. But at the end of the day, I just want a simple website and now I'm using <a href=\"https://github.com/LukeSmithxyz/lb\">Luke Smith's lb</a>.</p><p>Pretty cool? At least I think it is. This 'blog' also has an <a href=\"/rss\">RSS feed</a>. You can subscribe to it. That's it for now!</p>","date":"2021-09-04T18:01:55.848+07:00","pubDate":"Sat, 04 Sep 2021 18:01:55 +0700","guid":1630753315000}]
