{"title":"A Zoomer Thought on Fiction and Reality","description":"<p><i>It's time for a zoomer rambling.</i> </p><p>There is a recent Twitturd post in which the user stated that media such as Honkai Impact and Wonder Egg Priority did a good job in representing homosexuality in their narrative. When I say \"homosexuality\", it's tied to the American-style identity politics rather than just a form of sexuality of the neurotics (you know where this is going).</p><p>However, what really happens in those two media, two pieces of fiction? Yes, it's true that there are same-sex relationships (romantic and not) in the two media. Or, for those who aren't ready to accept the previous, there are \"weirdly intimate friendships\" between the girls. Still, I don't think that the sexuality of these girls translates directly to our real-world situation about homosexual identity politics. Why is that? It's because fiction should be taken in its most literal state, that we should only take what's already on the surface: when there's no indication, leave it be.</p><h2>No Truth</h2></p><p>The Twitturd user stated most Honkai Impact players ignored the so-called subtext of the game, the \"subplots\" about relationships between girls. I think that's actually the safest way of consuming fiction, to take it literally. This doesn't mean that it's the only way of doing it. Some forms of interpretations are good ways to enjoy fiction, to indulge in its ecstasy. Considering Honkai Impact and Wonder Egg Priority as paragons of homosexuality falls under this. However, it's wrong if we assume that by doing interpretations, we can arrive at the \"truth\" about the questioned fiction. Interpretations will never provide us with \"truth\".</p><p>The only \"truth\" we can access about fiction is that there is no hidden truth. There's this illusion that we must unveil a certain mask to access some sort of raw or pure knowledge. This is, I think, a form of human's most basic instinct: to desire something unknown, to desire more and more. We're expecting some fiction to hold hidden meaning, that is our desire. The problem arises when we're presented that there's nothing behind them. We will keep denying it, keep saying that \"it is not it!\" because we don't understand what we want in the first place and yet, we want more and more. It is, then, only natural for us to hide from this shock by constructing our own \"truth\" about the questioned fiction so that we can enjoy more, free from the deadlock of nothingness. When we do this, we enter what I previously call \"interpretations\".</p><h2>Fiction and Reality</h2></p><p>Another reason for the tendency to do interpretations is also rooted in our way of thinking that fiction is just fiction, something that isn't \"real\". The case would be different if someone didn't privilege the so-called everyday reality over fiction, if one saw fiction as another \"reality\", or in other words: if one saw that reality is just another fiction. This might be hard to accept and at first, this seems like blending reality with fiction. However, I'd say that someone who dismisses fiction that easily is in fact the one who confuses reality with fiction. In contrast, someone who privileges neither is the one who could distinguish the two. How does this work? By being aware that fiction is an autonomous realm of its own, they are safe in investing their mental energy in the two (or even more) realities. For them, then, fiction isn't a direct representative of real-world situations. It's neither their desire for a certain real-world situation to happen. For them, fiction is an authentic experience. Meanwhile, someone who privileges everyday reality over fiction is often lost. They're too quick to dismiss fiction that what's inside it must translate directly to some \"real\" social conditions. That's why they proceeded to do interpretations.</p><p>Indeed, it's easy to fall into the temptation to see fiction as reflections of reality. An example is seeing the rise of mahou shoujo trope as a sign of young girl empowerment, commonly seen in the realm of feminist academia. Mahou shoujo is a strong girl, not a damsel in distress. She isn't passive and often not subjected to the common norm of what a girl should be. It's tempting to see her as a paragon of young girl empowerment here. However, if we aren't very oblivious, we can see that mahou shoujo is often highly sexualized too. Is mahou shoujo then an indicator that young girls are sexually mistreated in real-world situations? I don't think either way of seeing mahou shoujo is correct because, again, fiction doesn't directly reflect some social situations. By not privileging everyday reality over fiction, one can see mahou shoujo as an independent \"object\" in another reality.</p><h2>Abrahamic Influence</h2></p><p>Is it too farfetched to say that Abrahamic religions influenced the global community, notably the West, to privilege everyday reality over fiction and to do what I previously call interpretations? The problem isn't \"grow up and accept reality lmao\". Rather, it's related to the anxiousness of the adherents of the Abrahamic religions about God. Firstly, God is unimaginable, and secondly, creating idols is forbidden. This led them to create and enjoy something (fiction) with excessive care. I'm not really confident with this myself but that's enough of that.</p><p>Lastly, I want to go back to interpretations once again and say \"enjoy!\" because I don't think any normal human can elude the nothingness behind fiction. And to the gentlemen of the jury, let us see how much of this zoomer thought will change in the next few years.</p>","date":"2021-12-15T17:35:02.895+07:00","pubDate":"Wed, 15 Dec 2021 17:35:02 +0700","uri":"a-zoomer-thought-on-fiction-and-reality"}