{"title":"Notes on Early 2010s Weebs","description":"<p><i>I can't believe I call myself a weeb/wibu/otaku but rarely write about them.</i></p><p>I recently watched the Sword Art Online: Progressive movie, the one with the title <i>Hoshi Naki Yoru no Aria</i> (Aria of a Starless Night). It reminded me of 10 years ago when the Sword Art Online TV series first aired. The early 2010s was, I think, one of the pivotal moments in weeb culture because it gave born to a new generation of, well, weebs. It sounds like a generalization but if we narrow it down to only <b>Indonesian weebs</b>, I know I'm right. Let's ignore the previous generation(s) and the recently born one during the pandemic.</p><p>What I like about these early 2010s weebs is that they know how to consume otaku media freely. They know how to use some Internet to hop between fansubs. Alternatively, hey, they know how to distinguish between download buttons that will really give them subbed anime or the one that will give them ads. Older weebs may have these \"abilities\" as well, but at the time they were already adults. That's not really impressive because adults should have those as basic Internet survival abilities. However, early 2010s weebs were mainly composed of teenagers. Therefore, if one of them was a <i>chuunibyou</i>, there's a chance if the person is a <i>chuuninensei</i> in a literal sense! Isn't it cool for them to be able to consume otaku media in a rather free manner? To choose one's favorite fansub, to choose a niche community to dwell in, that's the freedom of being a weeb.</p><p>The trends have changed nowadays, not to mention with the emergence of new groups of weebs during the pandemic. Most of them are at the mercy of big streaming services, or even worse a YouTube channel. It's because, according to my observation, they're afraid to consume anime from \"third-party sites\" or they don't know how to find them.</p><p>Time indeed flies, but oh well.</p><p></p>","date":"2022-01-13T15:37:11.353+00:00","pubDate":"Thu, 13 Jan 2022 15:37:11 +0000","uri":"notes-on-early-2010s-weebs"}