{"title":"I hath becometh a Yu-Gi-Zoomer: Ecclesia and other waifu","description":"<p>I'm writing this entry to test if I can put some images (no fancy layout, though). All of the previous entries are just pure text. Let's see how it goes by putting some waifu. Yu-Gi-Oh Waifu!</p><p>On late January 2022, the Japanese entertainment conglomerate and video game company Komoney released Yu-Gi-Oh! Master Duel. I had a little real-life Yu-Gi-Oh experience previously, but it all was just about playing (old and outdated) waifu decks. The habit continues to Master Duel when I discover more waifu. Here are some of my favorites so far.</p><h2>Ecclesia</h2></p><div class=\"text-center m-3\"><img src=\"https://pl.nikotile.xyz/media/79544ebe6407b643625376cda50687c7921127072fcee99c117ea96574a7cc18.png\"></p><div class=\"text-center m-3\"><img src=\"https://pl.nikotile.xyz/media/c04c1b08e6b844a4397962b1262ff97d2d8a779aaedb1687c5e40b7dcdef496c.png\"></p><p>Her name shall be mentioned on the title.</p><p>Despite being the same Ecclesia. The two cards come from different archetypes. The lore around it is so cool. They're also related to other archetypes such as Tri-Brigade, Springans, Despia, Swordsoul, and probably other archetypes I have no knowledge of. Komoney really should invest in anime or other media that explain this lore! They're keep making anime to promote the cards, and probably to younger audience.</p><h2>Sera and Rafflesia</h2></p><div class=\"text-center m-3\"><img src=\"https://pl.nikotile.xyz/media/803f8c12bde20a29e144795b5224cf8b9673c921f08e29f14be7b5acc3e45dae.png\"></p><div class=\"text-center m-3\"><img src=\"https://pl.nikotile.xyz/media/b9712fab03c66c483f46ec2ef568aa718638954fab30c924c6d32eae3e2d6a44.png\"></p><p>They're from the Traptrix archetype. I use this archetype very frequently because I like the idea of luring my enemies (or myself, actually) into cute anime girls who turn out to have very dangerous traps set.</p><h2>Verre</h2></p><div class=\"text-center m-3\"><img src=\"https://pl.nikotile.xyz/media/cb25a3fe7457fcc63cafba53c31b2a5d742f0d718ec9948aa8aa9a929fb6fccf.png\"></p><div class=\"text-center m-3\"><img src=\"https://pl.nikotile.xyz/media/b7e47d4ef56c220706c712df859912cb3bbad5a6e111f270111cee5f3d019617.png\"></p><p>The smug queen Witchcrafter Madame Verre is probably a lolibaba. The second card, Rilliona, is supposed to be her younger self. But doesn't it make it cooler?</p><h2>Teardrop</h2></p><div class=\"text-center m-3\"><img src=\"https://pl.nikotile.xyz/media/e44918686856e606def74176ef54b977093f6e876f301c384afe891d88073d67.png\"></p><p>I like her because, well, not much reasoning, it's just very cute and very anime.</p><p>Yes, that's it. That was me posting some waifu by testing my website feature as an excuse.</p>","date":"2022-04-06T20:44:53.445+07:00","pubDate":"Wed, 06 Apr 2022 20:44:53 +0700","uri":"i-hath-becometh-a-yu-gi-zoomer-ecclesia-and-other-waifu"}